/* Напишете програма на С, която съдържа 3 функции,
изнесете прототипите им в отделен .h файл.
1. Първата функция да калкулира най-малко общо кратно на две положителни
числа.
2. Втората функция връща абсолютна стойност на числата (положителната
стойност на числата).
    a. Трябва да може да приеме като параметър float и да върне float.
    b. Тествайте с инт и float.
3. Напишете функция, която калкулира корен квадратен от число.
    a. Проверете дали резултатът е отрицателно число и върнете -1.
    b. Използвайте втората си функция, за да обърнете числото в положително и
да намерите корен квадратен от него. */

#include <stdio.h>
#include "p.h"

int main()
{
    float a = 0, b = 0;
    printf("a for fabs and sqrt: ");
    scanf("%f", &a);

    printf("b for fabs and sqrt: ");
    scanf("%f", &b);

    min();
    fabsCopy(a, b);
    printf("\nSqrt a: %.2f", sqrtCopy(a));
    printf("\nSqrt b: %.2f", sqrtCopy(b));
    return 0;
}
