/* Дефинирайте едномерен масив int с 10 елемента =
{100,90,80,70,60,50,40,30,20,10} Дефинирайте пойнтер, който ще сочи към
масива.
Достъпете 3 тия елемент от масива и му задайте стойност 5.
Достъпете 4 тия елемент и му задайте стойност 33.
Достъпете 5 тия елемент и го намалете със 7.
Достъпете 7 мия елемент и го увеличете с 10.
Достъпете 10 тия елемент и го умножете по 3.
Изпишете го по двата възможни начина и закоментирайте единия.
Принтирайте на екрана всички елементи на масива. */

#include <stdio.h>

int main(){
    int iArr[10] = {100,90,80,70,60,50,40,30,20,10};
    int *ptrArr = iArr;

    *(ptrArr + 2) = 5;
    *(ptrArr + 3) = 33;
    *(ptrArr + 4) = *(ptrArr + 4) - 7;
    *(ptrArr + 6) = *(ptrArr + 6) + 10;
    *(ptrArr + 9) = *(ptrArr + 9) * 3;

/*  iArr[2] = 5;
    iArr[3] = 33;
    iArr[4] = iArr[4] - 7;
    iArr[6] = iArr[6] + 10;
    iArr[9] = iArr[9] * 3; */

    int i = 1;
    for(i = 1; i<11; i++){
        printf("%d element is: %d\n",i,*ptrArr); // Вместо *p може да е arr[i-1]
        *ptrArr++;
    }
    return 0;
}