/* Използване на метода на мехурчето за сортиране на масив от
числа (виж. wiki).
Потребителят въвежда броя числа и след това въвежда всяко
едно число. Напишете програма, която трябва да сортира числата
и да ги изведе в сортиран вид, като най-малкото се извежда първо.
Вариация: Да се направи същото с масив от символи. */

#include <stdio.h>

int main()
{
    char c[80] = "0";
    char temp = '0';
    int offSet = 0;
    int i = 0;
    int j = 0;
    int count = 0;

    printf("Enter string: ");
    gets(c);

    while (*(c + offSet) != '\0')
    {
        count++;
        offSet++;
    }
    for (i = 0; i < count; i++)
    {
        for (j = 0; j < count - 1; j++)
        {
            if (c[j] > c[j + 1])
            {

                temp = c[j];
                c[j] = c[j + 1];
                c[j + 1] = temp;
            }
        }
    }
    puts(c);
    return 0;
}