/* Напишете функциите като макроси:
1. функция AVG(x, y), която смята средното аритметично на две подадени
като параметър числа.
2. функция AVG, която смята средното аритметично на числата от
определен диапазон.
3. Напишете функцията повдигане на степен, която повдига х на степен у
4. Напишете функцията TOUPPER, която прави малката буква а в голяма А
5. Напишете функцията DISP((f), (x)), която показва резултата от функции
връщащи double като корен квадратен. DISP(sqrt, 3.0)
Макрото трябва да се експандне до printf(“sqrt (%g) = %g\n”, 3.0, sqrt(3.0)); */

#include <stdio.h>
#include <math.h>
#define AVG(x, y) ((x + y) / 2)
#define AVGD(average, x, y)             \
    {                                   \
        for (i = (x); i <= (y); i++)    \
        {                               \
            average += i / ((y) - (x)); \
        }                               \
    }
#define POW(res, a, b) ( res = pow(a, b))

#define TOUPPER(a) (a - 32)
#define DISP(f, x) printf("Sqrt(%g) = %g\n", x, sqrt(x))
int main(void)
{
    int i;
    int sum = 0;
    // функция AVG(x, y), която смята средното аритметично на две подадени като параметър числа.
    printf("Average of 6 and 8 = %d\n", AVG(6, 8));

    //  функция AVG, която смята средното аритметично на числата от определен диапазон.
    int average = 0;
    AVGD(average, 5, 9);
    printf("The average of the numbers between %d and %d is %d\n", 5, 9, average);

    // Напишете функцията повдигане на степен, която повдига х на степен у
    int res = 0;
    POW(res, 2, 3);
    printf("2^3 = %d\n", res);

    //Напишете функцията TOUPPER, която прави малката буква а в голяма А
    printf("TOUPPER = %c\n", TOUPPER('s'));

    // Напишете функцията DISP((f), (x)), която показва резултата от функции връщащи double като корен квадратен.
    DISP(sqrt, 3.0);
    
    return 0;
}