/* Дефинирайте и инициализирайте int променлива = 34 и
пойнтер към нея.
Опитайте да ги разместите, като поредност (първо да е
пойнтерът, после променливата).
Можете ли да умножите пойнтер по пойнтер?
При тази декларация колко пойнтера имаме: - 1  пойнтер
int *p, k; */

#include <stdio.h>

int main()
{
    int *pI = &i; /* дава грешка, тъй като още не сме декларилари променливата i = 34, C чете отгоре надолу*/
    int i = 34;

    return 0;
}
void multiplyPointers()
{
        int iNum1 = 5;
        int iNum2 = 5;

        int *pNum1 = &iNum1;
        int *pNum2 = &iNum2;

        int multiply = (*pNum1) * (*pNum2);
        printf("%d\n", multiply);
}