/* . Напишете програма, която сумира всички елементи на масив
намиращи се на четна позиция:
int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
Декларирайте пойнтер към първата нечетна позиция, инкрементирайте
пойнтера по подходящ начин, за да извършите сумирането. */

#include <stdio.h>
int sumNum(int *iArr){
    int *p = &iArr[1];
    int sum = 0, i;

    for(i = 1; i < 9; i++){
        if(i % 2 != 0)
        { 
            sum = sum + *(p+i);

        }
    }
    return sum+iArr[0];
}
int main(){
    int arr[10] = {23, 91, 36, 4, 9, 99, 87, 11, 2, 33};
    printf("%d", sumNum(arr));
    return 0;
}
