// В какъв ред ще се изпълнят операциите?  true = x&&y&x<<1;
// Какво ще се принтира на екрана?
// В какъв ред ще се изпълнят операциите?  true = x&&y^x<<1;
// Какво ще се принтира на екрана?

#include <stdio.h>

int main()
{
    int x = 10;
    int y = 10;
    int true = 0;
    // ще се изпълни отдясно на ляво; първо шифтва <<, след това побитово И и накрая логическо И
    true = x && y & x << 1; //true = 0;
    printf("%d\n", true);

    // ще се изпълни отдясно на ляво; първо <<, след това XOR и накрая логическо И
    true = x && y ^ x << 1; //true = 1;
    printf("%d\n", true);

    return 0;
}