/*  Дефинираме променлива “а“, дефинираме
пойнтер, но още не му задаваме стойност. Отпечатайте
адреса на “а”. След това присвояваме стойност на
пойнтера, като внимаваме типовете на пойнтера и
променливата да са от един и същи тип. Отпечатваме
на екрана стойността на пойнтера с %р, стойността на
„а“ с %d, стойността на *ptr с %d */

#include <stdio.h>

int main(){
    int a = 5; // дефинираме променлива
    int *p = NULL; // дефинираме пойнтер
    printf("A adress: %p\n", &a); // печатаме адреса на А
    p = &a; // задаваме стойност
    printf("P value = %p\n", p); // печата пойнтер - адрес в паметта
    printf("A value = %d\n", a); // печата стойността на а
    printf("*p value = %d\n", *p);// печата стойността на а, тъй като на 15. ред я задаваме на пойнтера
    return 0;
}