/* Напишете текст с форматиращ параметър.
int fprint(FILE* stream, const char *forma…);
Първият параметър е файл стрийм, вторият е
форматиращият знак, следван от броя му и т.н.
Форматиращият знак може да е спейс, спецификатор и
т. н.
При успешно изпълнение функцията връща броя на
записаните символи, при грешка връща негативна
стойност */

#include <stdio.h>
#include <stdlib.h>

int main()
{
    FILE *fp;

    fp = fopen("9.txt", "w+");
    fprintf(fp, "%s %s %s %s %s", "That", "is", "the", "ninth", "task.");

    fclose(fp);

    return (0);
}